app/Controllers/menucontroller.php

    public function tampil()
    {
        $data['data'] =$this->menu->findAll();
---
SELECT *
FROM `tb_menu`