app/Controllers/pesanancontroller.php

SELECT `id`, `nama`
FROM `tb_menu`
---
    public function index()
    {
        $data['data']=$this->menu->select('id,nama')->findAll();