app/Controllers/usercontroller.php

    public function tampil()
    {

        #code...
        //$users = new Users();
        $data['duser'] = $this->user->findAll();
---
SELECT *
FROM `tb_user`

    public function simpan()
    {
        #code...
        $data = array(
            'nama' =>$this->request->getPost('nama'),
            'password'=> password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'username'=> $this->request->getPost('username'),
            'jenis_kelamin'=> $this->request->getPost('jenis_kelamin'),
            'jenis'=> $this->request->getPost('jenis')
        );
        $this->user->insert($data);
---
INSERT INTO `tb_user` (`nama`, `password`, `username`) VALUES ('dewi', '$2y$10$1grSF0UgEB3I8/v2VrHco.ROc/ru4ksn2O7hIeRb/wwDVbTUoO9YG', 'dewi')

    public function edit($id)
    {
        #code...
        // dd($this->request->getPost('password));
        $datac = array(
            'nama'=>$this->request->getPost('nama'),
            'password'=> password_hash($this->request->getPost('password'),PASSWORD_DEFAULT),
            'username'=> $this->request->getPost('username'),
            'role'=> $this->request->getPost('role')
        );
        $this->user->update($id, $datac);
---
UPDATE `tb_user` SET `nama` = 'dewi', `password` = '$2y$10$neKK3wtBu.R.uuZcgQSvNuRIN8e64voAZkqv4ckBWlZH1MMpkRKNG', `username` = 'reni', `role` = 'Admin'
WHERE `tb_user`.`id` IN ('5')

    public function delete($id)
    {
        #code...
        $this->user->delete($id);
---
DELETE FROM `tb_user`
WHERE `id` IN ('2')